DataProcessors/гз_ФормированиеДоговоровПоГосударственнымЗакупкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>гз_ФормированиеДоговоровПоГосударственнымЗакупкам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаФормирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИтогиГосЗакупок</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ИтогиГосударственныхЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РегистрацияДоговоров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрацияДоговоров</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гз_РегистрацияДоговораПоГосударственнымЗакупкам</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Специфика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_ЭКР</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗакупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/гз_СвойстваНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>гз_СвойстваНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаименованиеНаГосударственномЯзыке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПризнакВА</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гз_ГруппыВнеоборотныхАктивов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Специфика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_ЭКР</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособЗакупки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/гз_ИтогиГосударственныхЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>гз_ИтогиГосударственныхЗакупок</Name>
			<Comment>(гз)</Comment>
			<BasedOn>
				<xr:Item>Document.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</xr:Item>
				<xr:Item>Catalog.гз_ПроведенныеЗакупки</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.гз_РезервированиеПозицийГодовогоПлана</xr:Item>
				<xr:Item>AccumulationRegister.гз_ДвижениеНоменклатурыПоГодовомуПлану</xr:Item>
				<xr:Item>InformationRegister.гз_СостоянияТекущихЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.гз_СостояниеКонкурсовПоГосударственнымЗакупкам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гз_ОбъявлениеОПроведенииГосударственныхЗакупок</v8:Type>
						<v8:Type>cfg:CatalogRef.гз_ПроведенныеЗакупки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Регл) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнатьКонкурсНеСостоявшимсяПоВыбраннымПозициям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВторойПослеПобедителя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МестоПоставки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_МестаПоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Победитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗакупки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_СпособыЗакупки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена2</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИспользованиеВидовПлановЗакупок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидПланаЗакупок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гз_ВидыПлановЗакупок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/гз_ФормированиеДоговоровПоГосударственнымЗакупкам/Ext/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит значение признака ведения учета по спецификам
Перем ВедениеУчетаПоСпецификам Экспорт; // экспортная переменная

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

#Если Клиент Тогда

	// Производит автозаполнение табличной части РКО
	//
	Процедура Автозаполнение() Экспорт
			
		ТекстЗапрос = 	
		"ВЫБРАТЬ
		|	РезультатИтогов.Победитель КАК Контрагент,
		|	СУММА(РезультатИтогов.Сумма) КАК Сумма,
		|	гз_РегистрацияДоговораПоГосударственнымЗакупкам.Ссылка КАК ДокументРегистрацияДоговоров,
		|	РезультатИтогов.Ссылка КАК Ссылка,"+?(Не ВедениеУчетаПоСпецификам,"","
		|	РезультатИтогов.Специфика,")+"
		|	РезультатИтогов.СпособЗакупки
		|Из
		|	(ВЫБРАТЬ
		|		гз_ИтогиГосударственныхЗакупокТовары.Победитель,
		|		гз_ИтогиГосударственныхЗакупокТовары.Цена * гз_ИтогиГосударственныхЗакупокТовары.Количество КАК Сумма,
		|		гз_ИтогиГосударственныхЗакупокТовары.Ссылка.Ссылка,
		|		Характеристики.Специфика,
		|		гз_ИтогиГосударственныхЗакупокТовары.СпособЗакупки
		|	Из
		|		Документ.гз_ИтогиГосударственныхЗакупок.Товары КАК гз_ИтогиГосударственныхЗакупокТовары
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гз_СвойстваНоменклатуры КАК Характеристики
		|				ПО Характеристики.Номенклатура = гз_ИтогиГосударственныхЗакупокТовары.Номенклатура
		|	ГДЕ
		|		гз_ИтогиГосударственныхЗакупокТовары.Ссылка.Ссылка = &Ссылка) КАК РезультатИтогов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гз_РегистрацияДоговораПоГосударственнымЗакупкам КАК гз_РегистрацияДоговораПоГосударственнымЗакупкам
		|		ПО РезультатИтогов.Победитель = гз_РегистрацияДоговораПоГосударственнымЗакупкам.Контрагент
		|			И РезультатИтогов.Ссылка = гз_РегистрацияДоговораПоГосударственнымЗакупкам.ДокументОснование"+?(Не ВедениеУчетаПоСпецификам,"","
		|			И РезультатИтогов.Специфика = гз_РегистрацияДоговораПоГосударственнымЗакупкам.Специфика")+"
		|			И РезультатИтогов.СпособЗакупки = гз_РегистрацияДоговораПоГосударственнымЗакупкам.СпособЗакупки
		|
		|СГРУППИРОВАТЬ ПО
		|	РезультатИтогов.Победитель,
		|	РезультатИтогов.Ссылка,
		|	гз_РегистрацияДоговораПоГосударственнымЗакупкам.Ссылка,"+?(Не ВедениеУчетаПоСпецификам,"","
		|	РезультатИтогов.Специфика,")+"
		|	РезультатИтогов.СпособЗакупки";
		
		Запрос = Новый Запрос(ТекстЗапрос);
		Запрос.УстановитьПараметр("Ссылка",ИтогиГосЗакупок);
		         
		РегистрацияДоговоров.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецПроцедуры // Автозаполнение()

	// Создает документы регистрации договоров по отмеченным строкам
	//
	// Параметры
	//  нет
	//
	Процедура СоздатьДокументы() Экспорт
		гз_ПроцедурыОперативногоУчетаЗакупок.СоздатьДокументыРегистрацииДоговоров(ЭтотОбъект);		
	КонецПроцедуры // СоздатьДокументы()

	//Процедура ЗаполнитьТЧДокумента
	//
	Процедура ЗаполнитьТЧДокумента(ДокументРег, Контрагент, Специфика, СпособЗакупки,СуммаАвансаПоДоговору) Экспорт 
		ВедениеУчетаПоСпецификам  = Константы.гз_ВестиУчетПоСпецификам.Получить();

		гз_ПроцедурыОперативногоУчетаЗакупок.ЗаполнитьТЧДокументаРегистрацияДоговора(ИтогиГосЗакупок,ДокументРег, Контрагент,
										Специфика, СпособЗакупки,СуммаАвансаПоДоговору,ВедениеУчетаПоСпецификам);
	КонецПроцедуры //ЗаполнитьТЧДокумента

#КонецЕсли

// Создает документы РКО по отмеченным строкам
//
// Параметры
//  нет
//
Функция СформироватьЗапросДляОтображенияДанных(ДокументРегистрацияДоговоров) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Док.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Док.Проведен
	|					ТОГДА 0
	|				ИНАЧЕ 2
	|			КОНЕЦ
	|	КОНЕЦ КАК ИндексКартинки
	|Из
	|	Документ.гз_ИтогиГосударственныхЗакупок КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", ДокументРегистрацияДоговоров);
	Возврат Запрос.Выполнить();

КонецФункции // СоздатьДокументы()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ВедениеУчетаПоСпецификам  = Константы.гз_ВестиУчетПоСпецификам.Получить();
